Tasks/ИА_ЗадачаПланаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>ИА_ЗадачаПланаДействий</Name>
			<Addressing>InformationRegister.ИА_АдресацияЗадачПланаДействий</Addressing>
			<BasedOn>
				<xr:Item>Task.ИА_ЗадачаПланаДействий</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданаИзПлана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отложена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПослание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗРС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СМСОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоКомлиниям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостАвтора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминатьС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминатьПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ситуация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрикрепленныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_РегламентныеЗадачиКоммцентра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлена</Name>
					<Comment>призна того что была нажата кнопка Отправить</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительЗРС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_ТочкаБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_ВариантУсловияБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_ИсключенаИзОбработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_БПДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПереписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклонениеЗРС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗРСП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СитуацияТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокладОбИсполнении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаСУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_СтратегическоеУправление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКоррекцияСУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительОтказЗРС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаявкаНаОбязательства</v8:Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
						<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСУ_ПриоритетЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХодВыполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоКомментарий</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маршрут</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пост</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсеВерно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПодтверждения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МаршрутПередачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подзадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнил</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Tasks/ИА_ЗадачаПланаДействий/Forms/ФормаПрикрепленныхФайлов/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	//Закрыть(КодВозвратаДиалога.ОК);
	Струк = Новый Структура;
	Струк.Вставить("СписокДобавленныхФайлов", СписокДобавленныхФайлов.ВыгрузитьЗначения());
	
	мФайлы = Новый Массив;
		
	Для Каждого Стр Из Файлы Цикл
		мСтрук = Новый Структура;
		мСтрук.Вставить("Имя",Стр.Имя);
		мСтрук.Вставить("Дата",Стр.Дата);
		мФайлы.Добавить(мСтрук);
	КонецЦикла;
	
	Струк.Вставить("СписокДобавленныхФайлов", СписокДобавленныхФайлов.ВыгрузитьЗначения());
	Струк.Вставить("Файлы", мФайлы);
	Струк.Вставить("КодВозврата",КодВозвратаДиалога.ОК);
	Закрыть(Струк);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБезСохранения(Команда)
	Закрыть(КодВозвратаДиалога.Отмена);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	ПутьКФайлу = ПолучитьПутьКФайлу();
	Если ПутьКФайлу = "" Тогда
		Сообщить("В настройках не указан путь к хранению файлов!", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
		
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ДобавитьФайлЗавершение1", ЭтотОбъект), ,, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлЗавершение1(Результат, Адрес, ВыбранноеИмя, ДополнительныеПараметры) Экспорт
	
	
	Если Результат Тогда
		
		ФайлНаДискеСуществует = Ложь;
		КаталогНаДиске = "";
		
		ПоместитьФайлОбъектаНачало(Номер, Адрес, ВыбранноеИмя, ФайлНаДискеСуществует, КаталогНаДиске);  //ФайлНаДискеСуществует, КаталогНаДиске будут возвращены
		
		ВыбранныйВариантДействия = Неопределено;
		Если ФайлСуществует(КаталогНаДиске, ВыбранноеИмя) Тогда
			
			ВариантыДействий = Новый СписокЗначений;
			ВариантыДействий.Добавить(2, "Заменить");
			ВариантыДействий.Добавить(1, "Сохранить оба файла");
			ВариантыДействий.Добавить(0, "Отменить загрузку");
			
			дп = новый Структура("АдресВременногоХранилища,КаталогНаДиске,ВыбранноеИмя",Адрес,КаталогНаДиске,ВыбранноеИмя);
			ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьФайлЗавершение", ЭтотОбъект,дп), "Файл "+ВыбранноеИмя+" уже существует!"+Символы.ПС+"Выберите действие которое надо совершить.", ВариантыДействий);     
			Возврат;
			
		КонецЕсли;
		
		ПоместитьФайлОбъектаОкончание(Адрес, КаталогНаДиске, ВыбранноеИмя, ВыбранныйВариантДействия);
		
		Модифицированность = истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыбранныйВариантДействия = РезультатВопроса;
	ПоместитьФайлОбъектаОкончание(ДополнительныеПараметры.АдресВременногоХранилища, ДополнительныеПараметры.КаталогНаДиске, ДополнительныеПараметры.ВыбранноеИмя, ВыбранныйВариантДействия);
	Модифицированность = Истина;

КонецПроцедуры



//Веб
&НаКлиенте
Процедура НачатьПодключениеРасширенияРаботыСФайламиЗавершение(Подключено, ДополнительныеПараметры) Экспорт    
    Если Не Подключено Тогда
        Оповещение = Новый ОписаниеОповещения("НачатьУстановкуРасширенияРаботыСФайламиЗавершение", ЭтаФорма, ДополнительныеПараметры);
        ТекстСообщения = НСтр("ru='Для продолжении работы необходимо установить расширение для веб-клиента ""1С:Предприятие"". Установить?'");
        ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет); 
    Иначе
		ОткрытьФайлЗавершение(Неопределено);
    КонецЕсли;    
КонецПроцедуры

//Веб
&НаКлиенте
Процедура НачатьУстановкуРасширенияРаботыСФайламиЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        НачатьУстановкуРасширенияРаботыСФайлами();
    КонецЕсли;    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	Если Элементы.Файлы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтаФорма,);
		НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	#Иначе
		ОткрытьФайлЗавершение(Неопределено);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлЗавершение(ДополнительныеПараметры) Экспорт
    имяФайла = Элементы.Файлы.ТекущиеДанные.Имя;
	АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(имяФайла);
	Если ЗначениеЗаполнено(АдресВременногоХранилища) Тогда
		врИмяФайла = КаталогВременныхФайлов() + имяФайла;
		#Если ВебКлиент Тогда
			ПолучитьФайл(АдресВременногоХранилища,врИмяФайла, истина);
		#Иначе
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
			ДвоичныеДанные.Записать(врИмяФайла);
			ЗапуститьПриложение(врИмяФайла);
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)	
	Если Элементы.Файлы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	#Если ВебКлиент Тогда
	    Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтаФорма);
	    НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	#Иначе
		СохранитьФайлЗавершение(Неопределено);
	#КонецЕсли
	
			
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлЗавершение(ДополнительныеПараметры) Экспорт
    Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Элементы.Файлы.ТекущиеДанные.Имя;
	ДиалогОткрытияФайла.Заголовок = "Сохранение файла";
	Расширение = Сред(Элементы.Файлы.ТекущиеДанные.Имя,Найти(Элементы.Файлы.ТекущиеДанные.Имя, ".")+1);
	Фильтр = "(*."+ Расширение +")|*."+Расширение+"";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Расширение = Расширение;	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		ВыбранныйКаталог = Новый Файл(ДиалогОткрытияФайла.Каталог);
		
		АдресВременногоХранилища = ПоместитьТекущийФайлВБуфер(Элементы.Файлы.ТекущиеДанные.Имя);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		
		Попытка
			ДвоичныеДанные.Записать(ДиалогОткрытияФайла.ПолноеИмяФайла);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПутьКФайлу()
	Возврат Константы.ИА_КаталогХраненияФайлов.Получить();
КонецФункции

// проверка наличия файла и его версий в рекурсии
&НаСервере
Процедура ПроверитьСуществованиеФайла(ИмяКаталога, ИмяФайла, Сч) 
    КаталогНаДиске = Новый Файл(ИмяКаталога+ИмяФайла);  
	Имя = КаталогНаДиске.ИмяБезРасширения; Расширение = КаталогНаДиске.Расширение;
    Если КаталогНаДиске.Существует() Тогда
		Позиция = Найти(Имя, "_"); 
		Если Позиция > 0 Тогда Имя = Лев(Имя, Позиция-1); КонецЕсли; 
		Сч = Сч + 1; ИмяФайла = Имя + "_" + Сч + Расширение;
		ПроверитьСуществованиеФайла(ИмяКаталога, ИмяФайла, Сч);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПоместитьТекущийФайлВБуфер(ВыбранноеИмя)
	
	КаталогХранения	= ПолучитьПолноеИмяФайла(ВыбранноеИмя); 
	ФайлДляПередачи = Новый ДвоичныеДанные(КаталогХранения);
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ФайлДляПередачи, УникальныйИдентификатор);
	
	Возврат АдресВременногоХранилища;
	
КонецФункции

&НаСервере
Функция ПолучитьПолноеИмяФайла(ВыбранноеИмя)
	
	КаталогХранения = Константы.ИА_КаталогХраненияФайлов.Получить();
	КаталогХранения = КаталогХранения + СОКРЛП(Номер) + "\";
	
	КаталогХранения = КаталогХранения + ВыбранноеИмя;
	
	Возврат КаталогХранения;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Номер = "";
	Параметры.Свойство("Номер", Номер);
	
	мФайлы = Новый Массив;
	Если Параметры.Свойство("Файлы", мФайлы) Тогда 
		Для Каждого Эл Из мФайлы Цикл 
			Стр = Файлы.Добавить();
			ЗаполнитьЗначенияСвойств(Стр,Эл);
		КонецЦикла;
	КонецЕсли;
			
КонецПроцедуры

//Арчил	Тваладзе 18.04.2016 добавление файла.
&НаСервереБезКонтекста
Процедура ПоместитьФайлОбъектаНачало(Номер, АдресВременногоХранилища, ВыбранноеИмя, ФайлНаДискеСуществует = Ложь, КаталогХранения = "")
	
	Если Найти(ВыбранноеИмя,"\")>0 или Найти(ВыбранноеИмя,"/")>0 Тогда
		Сч = СтрДлина(ВыбранноеИмя);
		Поз = 0;
		Пока Сч > 0 Цикл
			Симв = Сред(ВыбранноеИмя, Сч, 1);
			если Симв = "\" или Симв = "/" Тогда
				Поз = Сч;
				Прервать;
			КонецЕсли;
			Сч = Сч - 1;
		КонецЦикла;
		
		ВыбранноеИмя = Сред(ВыбранноеИмя, сч + 1);
	КонецЕсли;
	
	КаталогХранения = ПолучитьПутьКФайлу();
	
	КаталогХранения = КаталогХранения + СОКРЛП(Номер) + "\"; КаталогФайлов = КаталогХранения;
	
	КаталогНаДиске = Новый Файл(КаталогХранения);
	
	Если НЕ КаталогНаДиске.Существует() Тогда
		СоздатьКаталог(КаталогХранения);
	КонецЕсли;
	
	ФайлНаДискеСуществует = ФайлСуществует(КаталогХранения, ВыбранноеИмя);
	
КонецПроцедуры
	
&НаСервере
Процедура ПоместитьФайлОбъектаОкончание(АдресВременногоХранилища, КаталогФайлов, ВыбранноеИмя, ВыбранныйВариантДействия = 0)
	
	Если ВыбранныйВариантДействия = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	МодифицироватьФайлПоВыбранномуДействию(КаталогФайлов, ВыбранноеИмя, ВыбранныйВариантДействия); 
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	КаталогХранения = КаталогФайлов + ВыбранноеИмя;
	ДвоичныеДанные.Записать(КаталогХранения);
	
	СписокдобавленныхФайлов.Добавить(КаталогХранения);    //на случай, если задачу не сохранят и файлы придется удалять
	
	МассивСтрок = Файлы.НайтиСтроки(Новый Структура("Имя", ВыбранноеИмя));
	
	Если МассивСтрок.Количество()=0 Тогда
		НоваяСтрока = Файлы.Добавить();
	иначе 
		НоваяСтрока = МассивСтрок[0];
	КонецЕсли;
	
	НоваяСтрока.Имя = ВыбранноеИмя;
	НоваяСтрока.Дата = ТекущаяДата();
	НоваяСтрока.КаталогХранения = КаталогХранения;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФайлСуществует(ИмяКаталога, ИмяФайла)
	
	КаталогНаДиске =  Новый Файл(ИмяКаталога+ИмяФайла);
	
	ФайлСуществует = КаталогНаДиске.Существует();
	
	КаталогНаДиске =Неопределено;
	
	Возврат ФайлСуществует;
	
КонецФункции

&НаСервере
Процедура МодифицироватьФайлПоВыбранномуДействию(ИмяКаталога, ИмяФайла, ВыбранныйВариантДействия = 0) 
	
	КаталогНаДиске =  Новый Файл(ИмяКаталога+ИмяФайла);
 
	ИмяФайлаБезРасширения = КаталогНаДиске.ИмяБезРасширения; 
	Расширение = КаталогНаДиске.Расширение;
	НовоеИмяФайла = ИмяФайла;
	Сч =0;
	
	Если ВыбранныйВариантДействия = 2 Тогда //Замещаем файл на диске
		
	ИначеЕсли ВыбранныйВариантДействия = 1 Тогда // Добавляем к имени файла _<сч>
		
		Пока КаталогНаДиске.Существует() Цикл
			
			Сч = Сч + 1; 
			НовоеИмяФайла = ИмяФайлаБезРасширения + "_" + Сч + Расширение;
			КаталогНаДиске = Новый Файл(ИмяКаталога + НовоеИмяФайла);
			
			//навсякий случай прерывание.
			Если Сч = 1000000000 тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Слишком много файлов в каталоге! Выберите другой каталог!"; 
				Сообщение.Сообщить();
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;	
		
	Иначе    //отмена добавления файла
		Возврат;
	КонецЕсли;
	
	ИмяФайла = НовоеИмяФайла;
	
КонецПроцедуры


&НаКлиенте
Процедура Удалить(Команда)
	тд = Элементы.Файлы.ТекущиеДанные;
	Если тд<>Неопределено и тд.КаталогХранения<> "" и СписокДобавленныхФайлов.НайтиПоЗначению(тд.КаталогХранения)<>Неопределено Тогда
		файлы.Удалить(Элементы.Файлы.ТекущаяСтрока);
		УдалитьФайлНаСервере(тд.КаталогХранения);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьФайлНаСервере(ИмяФайла)
	
	УдалитьФайлы(ИмяФайла);
	
КонецПроцедуры
